Show / Hide Table of Contents
Class ParameterBool
Boolean parameter of cross-section
Inheritance
System.Object
OpenObject
Parameter
ParameterBool
Inherited Members
 Parameter.Name
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.CrossSection
Assembly: IdeaRS.OpenModel.dll
Syntax
public class ParameterBool : Parameter
Properties
Improve this Doc   View Source
Value
Value
Declaration
public bool Value { get; set; }
Property Value
 Type |  Description
 System.Boolean
 Improve this Doc
 View Source